
P A U P *
Version 4.0a (build 165) for Macintosh (X86) (built on Apr  2 2019 at 00:28:31)
Sunday, April 28, 2019 at 11:51:09 PM Central Daylight Time


paup> dset dist=jc;

paup> showdist;

Jukes-Cantor distance matrix
  191121 characters are included
  All characters have equal weight

                                        1        2        3        4        5        6        7
 1 Anolis carolinensis                  -
 2 Apalone ferox                  0.10429        -
 3 Carettochelys insculpta        0.10985  0.04845        -
 4 Chelonia mydas                 0.10054  0.03916  0.04733        -
 5 Chelydra sp                    0.09732  0.03641  0.04459  0.01707        -
 6 Chrysemys picta                0.09813  0.03646  0.04462  0.01726  0.01465        -
 7 Clemmys marmorata              0.09644  0.03543  0.04304  0.01593  0.01357  0.00555        -
 8 Crocodylus porosus             0.08707  0.05156  0.05727  0.04576  0.04324  0.04334  0.04172
 9 Cyclemys dentata               0.09620  0.03747  0.04511  0.01865  0.01669  0.01236  0.01121
10 Deirochelys reticularia        0.09664  0.03602  0.04397  0.01733  0.01482  0.00334  0.00589
11 Dermatemys sp                  0.09873  0.03988  0.04763  0.02285  0.01989  0.02103  0.01959
12 Dermochelys coriacea           0.10223  0.04279  0.05038  0.01357  0.02108  0.02138  0.02004
13 Erymnochelys madagascariensis  0.10615  0.05672  0.06330  0.04673  0.04378  0.04436  0.04294
14 Gallus gallus                  0.08811  0.06147  0.06699  0.05717  0.05422  0.05505  0.05320
15 Geochelone pardalis            0.10373  0.04396  0.05168  0.02507  0.02288  0.01888  0.01768
16 Geoemyda spengleri             0.09895  0.03820  0.04584  0.01927  0.01741  0.01275  0.01164
17 Gopherus berlandieri           0.09281  0.03686  0.04438  0.02063  0.01894  0.01546  0.01432
18 Graptemys pseudogeographica    0.09780  0.03652  0.04457  0.01729  0.01487  0.00278  0.00580
19 Homo sapiens19                 0.11312  0.10160  0.10649  0.09756  0.09367  0.09560  0.09341
20 Kinosternon flavescens         0.10108  0.04158  0.04892  0.02313  0.01953  0.02087  0.01952
21 Lepidochelys olivacea          0.10087  0.04041  0.04825  0.00611  0.01857  0.01884  0.01764
22 Lissemys punctata              0.10941  0.02795  0.05803  0.04963  0.04694  0.04709  0.04572
23 Nilssonia formosa              0.10460  0.00958  0.04797  0.03873  0.03616  0.03596  0.03485
24 Pelodiscus sinensis            0.10433  0.00976  0.04853  0.03894  0.03661  0.03650  0.03545
25 Pelomedusa subrufa1            0.10378  0.05247  0.05957  0.04208  0.03929  0.03943  0.03807
26 Pelusios castaneus             0.10378  0.05172  0.05872  0.04137  0.03858  0.03872  0.03724
27 Phrynops sp                    0.10113  0.04720  0.05429  0.03576  0.03323  0.03351  0.03210
28 Platemys platycephala          0.10161  0.04780  0.05472  0.03602  0.03350  0.03356  0.03221
29 Platysternon megacephalum      0.09762  0.03541  0.04328  0.01578  0.01344  0.00845  0.00743
30 Podocnemis erythracephala      0.10508  0.05544  0.06146  0.04553  0.04239  0.04249  0.04080
31 Python molurus                 0.08792  0.13289  0.13638  0.12801  0.12540  0.12667  0.12399
32 Rhinoclemmys punctularia       0.09159  0.03523  0.04270  0.01928  0.01762  0.01391  0.01267
33 Sphenodon punctatus            0.05991  0.03798  0.04244  0.03506  0.03349  0.03368  0.03269
34 Staurotypus triporcatus        0.10234  0.04307  0.05077  0.02473  0.02125  0.02255  0.02128
35 Sternotherus minor             0.10062  0.04138  0.04869  0.02267  0.01910  0.02053  0.01920
36 Terrapene ornata               0.09450  0.03478  0.04270  0.01618  0.01409  0.00595  0.00343
37 Testudo horsfieldii            0.10124  0.04215  0.04997  0.02328  0.02132  0.01713  0.01596
38 Trachemys scripta              0.09128  0.03360  0.04133  0.01567  0.01331  0.00207  0.00509

Jukes-Cantor distance matrix (continued)

                                        8        9       10       11       12       13       14
 8 Crocodylus porosus                   -
 9 Cyclemys dentata               0.04310        -
10 Deirochelys reticularia        0.04220  0.01240        -
11 Dermatemys sp                  0.04583  0.02252  0.02057        -
12 Dermochelys coriacea           0.04808  0.02266  0.02158  0.02655        -
13 Erymnochelys madagascariensis  0.05471  0.04447  0.04362  0.04746  0.04996        -
14 Gallus gallus                  0.04427  0.05480  0.05379  0.05550  0.05968  0.06343        -
15 Geochelone pardalis            0.04920  0.01516  0.01877  0.02794  0.02893  0.05094  0.05965
16 Geoemyda spengleri             0.04402  0.00657  0.01257  0.02280  0.02337  0.04572  0.05502
17 Gopherus berlandieri           0.04299  0.01209  0.01517  0.02421  0.02447  0.04407  0.05163
18 Graptemys pseudogeographica    0.04270  0.01256  0.00360  0.02100  0.02137  0.04402  0.05420
19 Homo sapiens19                 0.08131  0.09458  0.09446  0.09469  0.09911  0.10451  0.08425
20 Kinosternon flavescens         0.04669  0.02233  0.02054  0.01777  0.02702  0.04907  0.05729
21 Lepidochelys olivacea          0.04679  0.02033  0.01875  0.02412  0.01534  0.04796  0.05815
22 Lissemys punctata              0.05854  0.04731  0.04617  0.05035  0.05301  0.06589  0.06837
23 Nilssonia formosa              0.05086  0.03685  0.03546  0.03939  0.04233  0.05615  0.06134
24 Pelodiscus sinensis            0.05121  0.03738  0.03603  0.03992  0.04274  0.05679  0.06140
25 Pelomedusa subrufa1            0.05062  0.04028  0.03899  0.04310  0.04559  0.03509  0.06136
26 Pelusios castaneus             0.04982  0.03938  0.03811  0.04241  0.04488  0.03443  0.05981
27 Phrynops sp                    0.04658  0.03437  0.03300  0.03726  0.03937  0.03822  0.05788
28 Platemys platycephala          0.04719  0.03456  0.03323  0.03747  0.03948  0.03873  0.05732
29 Platysternon megacephalum      0.04174  0.01120  0.00867  0.01961  0.01976  0.04324  0.05340
30 Podocnemis erythracephala      0.05229  0.04307  0.04143  0.04561  0.04892  0.02716  0.06184
31 Python molurus                 0.10780  0.12340  0.12464  0.12385  0.13076  0.13407  0.10905
32 Rhinoclemmys punctularia       0.04287  0.00908  0.01386  0.02323  0.02305  0.04235  0.05246
33 Sphenodon punctatus            0.03234  0.03394  0.03294  0.03668  0.03741  0.04111  0.03779
34 Staurotypus triporcatus        0.04796  0.02408  0.02246  0.01940  0.02849  0.05055  0.05837
35 Sternotherus minor             0.04602  0.02202  0.02008  0.01733  0.02659  0.04876  0.05603
36 Terrapene ornata               0.04212  0.01173  0.00628  0.02004  0.02033  0.04273  0.05241
37 Testudo horsfieldii            0.04685  0.01358  0.01718  0.02658  0.02752  0.04911  0.05859
38 Trachemys scripta              0.03943  0.01128  0.00287  0.01965  0.01995  0.04099  0.05080

Jukes-Cantor distance matrix (continued)

                                       15       16       17       18       19       20       21
15 Geochelone pardalis                  -
16 Geoemyda spengleri             0.01512        -
17 Gopherus berlandieri           0.01347  0.01196        -
18 Graptemys pseudogeographica    0.01903  0.01303  0.01547        -
19 Homo sapiens19                 0.10027  0.09636  0.08971  0.09509        -
20 Kinosternon flavescens         0.02883  0.02302  0.02391  0.02098  0.09852        -
21 Lepidochelys olivacea          0.02680  0.02077  0.02214  0.01885  0.09824  0.02468        -
22 Lissemys punctata              0.05351  0.04840  0.04595  0.04719  0.10645  0.05185  0.05080
23 Nilssonia formosa              0.04333  0.03779  0.03643  0.03605  0.10135  0.04128  0.03988
24 Pelodiscus sinensis            0.04393  0.03824  0.03702  0.03669  0.10153  0.04176  0.04013
25 Pelomedusa subrufa1            0.04618  0.04128  0.03970  0.03922  0.10156  0.04443  0.04329
26 Pelusios castaneus             0.04553  0.04041  0.03904  0.03841  0.10070  0.04371  0.04254
27 Phrynops sp                    0.04062  0.03516  0.03512  0.03345  0.09843  0.03877  0.03705
28 Platemys platycephala          0.04075  0.03527  0.03492  0.03335  0.09850  0.03889  0.03727
29 Platysternon megacephalum      0.01735  0.01141  0.01420  0.00868  0.09462  0.01925  0.01732
30 Podocnemis erythracephala      0.04944  0.04411  0.04262  0.04201  0.10231  0.04773  0.04669
31 Python molurus                 0.13079  0.12678  0.11535  0.12643  0.14246  0.12827  0.12833
32 Rhinoclemmys punctularia       0.01634  0.00886  0.01433  0.01397  0.08824  0.02283  0.02080
33 Sphenodon punctatus            0.03858  0.03482  0.03685  0.03352  0.06241  0.03602  0.03633
34 Staurotypus triporcatus        0.03041  0.02471  0.02523  0.02270  0.09814  0.01157  0.02625
35 Sternotherus minor             0.02850  0.02269  0.02336  0.02068  0.09788  0.00395  0.02424
36 Terrapene ornata               0.01779  0.01207  0.01446  0.00626  0.09386  0.01960  0.01782
37 Testudo horsfieldii            0.01140  0.01353  0.01185  0.01743  0.09912  0.02701  0.02487
38 Trachemys scripta              0.01741  0.01168  0.01429  0.00172  0.09157  0.01932  0.01720

Jukes-Cantor distance matrix (continued)

                                       22       23       24       25       26       27       28
22 Lissemys punctata                    -
23 Nilssonia formosa              0.02761        -
24 Pelodiscus sinensis            0.02810  0.00692        -
25 Pelomedusa subrufa1            0.06176  0.05186  0.05245        -
26 Pelusios castaneus             0.06096  0.05112  0.05170  0.00760        -
27 Phrynops sp                    0.05690  0.04660  0.04699  0.03399  0.03332        -
28 Platemys platycephala          0.05744  0.04717  0.04756  0.03434  0.03360  0.00781        -
29 Platysternon megacephalum      0.04584  0.03478  0.03530  0.03846  0.03764  0.03217  0.03238
30 Podocnemis erythracephala      0.06410  0.05494  0.05508  0.03375  0.03289  0.03733  0.03741
31 Python molurus                 0.13780  0.13268  0.13290  0.13148  0.13189  0.12892  0.12829
32 Rhinoclemmys punctularia       0.04409  0.03471  0.03499  0.03814  0.03746  0.03314  0.03356
33 Sphenodon punctatus            0.04281  0.03783  0.03765  0.03879  0.03855  0.03615  0.03684
34 Staurotypus triporcatus        0.05314  0.04299  0.04339  0.04573  0.04490  0.04025  0.04050
35 Sternotherus minor             0.05141  0.04114  0.04162  0.04387  0.04293  0.03834  0.03844
36 Terrapene ornata               0.04446  0.03425  0.03478  0.03780  0.03697  0.03182  0.03199
37 Testudo horsfieldii            0.05216  0.04155  0.04226  0.04464  0.04391  0.03882  0.03897
38 Trachemys scripta              0.04302  0.03286  0.03344  0.03624  0.03562  0.03068  0.03079

Jukes-Cantor distance matrix (continued)

                                       29       30       31       32       33       34       35
29 Platysternon megacephalum            -
30 Podocnemis erythracephala      0.04145        -
31 Python molurus                 0.12490  0.13378        -
32 Rhinoclemmys punctularia       0.01260  0.04091  0.11625        -
33 Sphenodon punctatus            0.03283  0.03993  0.07387  0.03648        -
34 Staurotypus triporcatus        0.02120  0.04895  0.12964  0.02386  0.03681        -
35 Sternotherus minor             0.01886  0.04729  0.12838  0.02224  0.03502  0.01112        -
36 Terrapene ornata               0.00791  0.04069  0.12301  0.01314  0.03312  0.02124  0.01920
37 Testudo horsfieldii            0.01559  0.04747  0.12838  0.01483  0.03667  0.02848  0.02671
38 Trachemys scripta              0.00770  0.03924  0.11916  0.01336  0.03238  0.02076  0.01891

Jukes-Cantor distance matrix (continued)

                                       36       37       38
36 Terrapene ornata                     -
37 Testudo horsfieldii            0.01624        -
38 Trachemys scripta              0.00548  0.01589        -

paup> set criterion=distance;

Optimality criterion set to distance.

paup> dset objective=me;

paup> hsearch;

Heuristic search settings:
  Optimality criterion = distance (minimum evolution)
    Negative branch lengths allowed, but set to zero for tree-score calculation
    Distance measure = Jukes-Cantor
    191121 characters are included
    All characters have equal weight
  Starting tree(s) obtained via neighbor-joining
  Branch-swapping algorithm: tree-bisection-reconnection (TBR) with reconnection limit = 8
    Steepest descent option not in effect
  Initial 'Maxtrees' setting = 100
  Zero-length branches not collapsed
  'MulTrees' option in effect
  No topological constraints in effect
  Trees are unrooted

NOTE: Random-addition-sequence option is ignored when starting trees are obtained using neighbor-
      joining.

Heuristic search completed
  Total number of rearrangements tried = 12577
  Score of best tree(s) found = 0.51056
  Number of trees retained = 1
  Time used = 0.10 sec (CPU time = 0.11 sec)

paup> nj;

Neighbor-joining search settings:
  Ties (if encountered) will be broken systematically
  Distance measure = Jukes-Cantor
  191121 characters are included
  All characters have equal weight
  (Tree is unrooted)

NOTE: Random-addition-sequence option is ignored when starting trees are obtained using neighbor-
      joining.

Neighbor-joining tree:

                              /--------------------- Anolis carolinensis
          /-------------------+
          |                   \---------------------------------------- Python molurus
        /-+
    /---+ \..- Sphenodon punctatus
    |   |
 /--+   \----------------------------------------- Homo sapiens19
 |  |
/+  \----------------- Gallus gallus
||
|\------------ Crocodylus porosus
|
|                   /---- Apalone ferox
|                   |
|                /--+/-- Nilssonia formosa
|                |  \+
|        /-------+   \--- Pelodiscus sinensis
|        |       |
|      /-+       \------------- Lissemys punctata
|      | |
|      | \-------------------- Carettochelys insculpta
|      |
|      |         /- Chelonia mydas
|      |       /-+
|      |       | \-- Lepidochelys olivacea
|      |   /---+
|      |   |   \------ Dermochelys coriacea
|      |   |
|      |   |   /- Chrysemys picta
|      |   |   |
|      |   |   |/- Graptemys pseudogeographica
|      |   |   ++
|      |   |  /+\ Trachemys scripta
|      |   |  ||
|     /+   | /+\-- Deirochelys reticularia
|     ||   | ||
|     ||   | ||/- Clemmys marmorata
|     ||   |/+\+
|     ||   ||| \- Terrapene ornata
|     ||   |||
|     ||   ||\--- Platysternon megacephalum
|     ||   ||
|     ||   ++  /-- Cyclemys dentata
|     ||   ||  |
|     ||   ||  +--- Geoemyda spengleri
|     ||   || /+
|     ||   || |\--- Rhinoclemmys punctularia
|     ||   || |
|     ||   |\-+  /----- Geochelone pardalis
|     ||   |  | /+
|     ||   |  | |\---- Testudo horsfieldii
|     |\---+  \-+
\-----+    |    \--- Gopherus berlandieri
      |    |
      |    +----- Chelydra sp
      |    |
      |    | /------- Dermatemys sp
      |    | |
      |    \-+    /-- Kinosternon flavescens
      |      |  /-+
      |      |  | \- Sternotherus minor
      |      \--+
      |         \----- Staurotypus triporcatus
      |
      |         /---------- Erymnochelys madagascariensis
      |     /---+
      |     |   \--------- Podocnemis erythracephala
      |  /--+
      |  |  |       /--- Pelomedusa subrufa1
      |  |  \-------+
      \--+          \-- Pelusios castaneus
         |
         |      /--- Phrynops sp
         \------+
                \--- Platemys platycephala

Tree found by neighbor-joining method stored in tree buffer
Time used for tree calculation = 0.00 sec (CPU time = 0.00 sec)

paup> savetree file=nj.tre;

1 tree saved to file "~/Documents/Parsimony/nj.tre"

paup> upgma;

UPGMA search settings:
  Ties (if encountered) will be broken systematically
  Distance measure = Jukes-Cantor
  191121 characters are included
  All characters have equal weight
  (Tree is rooted)

NOTE: Random-addition-sequence option is ignored when starting trees are obtained using neighbor-
      joining.

UPGMA tree:

               /------------------------------------------------------- Anolis carolinensis
/--------------+
|              \------------------------------------------------------- Python molurus
|
|                                                               /------ Apalone ferox
|                                                               |
|                                                    /----------+ /---- Nilssonia formosa
|                                                    |          \-+
|                                          /---------+            \---- Pelodiscus sinensis
|                                          |         |
|                                          |         \----------------- Lissemys punctata
|                                          |
|                                          |                      /---- Chelonia mydas
|                                          |                 /----+
|                                          |                 |    \---- Lepidochelys olivacea
|                                          |             /---+
|                                          |             |   \--------- Dermochelys coriacea
|                                          |             |
|                                          |             |   /--------- Chelydra sp
|                                          |             |   |
|                                          |             |   |      /-- Chrysemys picta
|                                          |             |   |      |
|                                          |             |   |      |/- Graptemys pseudogeographica
|                                          |             |   |      ++
|                                          |            /+   |    /-+\- Trachemys scripta
|                                          |            ||  /+    | |
|                                          |            ||  ||   /+ \-- Deirochelys reticularia
|                                          |            ||  ||   ||
|                                          |            ||  ||   || /-- Clemmys marmorata
|                                          |            ||  ||/--+\-+
|                                          |            ||  |||  |  \-- Terrapene ornata
|                                      /---+            ||  |||  |
|                                      |   |            ||  |||  \----- Platysternon megacephalum
|                                      |   |            ||  |\+
|                                      |   |            |\--+ |   /---- Cyclemys dentata
|                                      |   |            |   | | /-+
|                                      |   | /----------+   | | | \---- Geoemyda spengleri
|                                      |   | |          |   | \-+
|                                      |   | |          |   |   \------ Rhinoclemmys punctularia
|                                      |   | |          |   |
|                                      |   | |          |   |  /------- Geochelone pardalis
|                                      |   | |          |   | /+
|                                      |   | |          |   | |\------- Testudo horsfieldii
|                                      |   | |          |   \-+
|                                      |   | |          |     \-------- Gopherus berlandieri
|                                      |   | |          |
|                                      |   | |          |  /----------- Dermatemys sp
|                                      |   | |          |  |
|                                      |   | |          \--+        /-- Kinosternon flavescens
|                                      |   | |             |   /----+
|                                  /---+   | |             |   |    \-- Sternotherus minor
|                                  |   |   | |             \---+
|                                  |   |   | |                 \------- Staurotypus triporcatus
|                                  |   |   | |
|                                  |   |   \-+    /-------------------- Crocodylus porosus
|                                  |   |     +----+
|                                  |   |     |    \-------------------- Sphenodon punctatus
|                                  |   |     |
|                                  |   |     |       /----------------- Erymnochelys madagascariensis
|                                  |   |     |  /----+
|                                  |   |     |  |    \----------------- Podocnemis erythracephala
|         /------------------------+   |     |  |
|         |                        |   |     \--+                /----- Pelomedusa subrufa1
|         |                        |   |        |/---------------+
|         |                        |   |        ||               \----- Pelusios castaneus
|         |                        |   |        \+
|         |                        |   |         |               /----- Phrynops sp
|         |                        |   |         \---------------+
\---------+                        |   |                         \----- Platemys platycephala
          |                        |   |
          |                        |   \------------------------------- Carettochelys insculpta
          |                        |
          |                        \----------------------------------- Gallus gallus
          |
          \------------------------------------------------------------ Homo sapiens19

Tree found by UPGMA method stored in tree buffer
Time used for tree calculation = 0.00 sec (CPU time = 0.00 sec)

paup> savetree file=upgma.tre;

paup> savetree file=upgma.tre;

paup> deroot;

1 tree converted from rooted to unrooted.

paup> savetree file=upgma.tre;

1 tree saved to file "~/Documents/Parsimony/upgma.tre"

paup> log stop;
